aptech-php-21-Huy/aptech-php-21-Huy/Du-an-ca-nhan/GNS_STM32F1 PCB_308_1/Src/stm32f1xx_GPS.c
  fcs = (fcs>>8)^crctab16[(fcs^*pData)&0xff]; 
  nLength--; 
  pData++; 
}
return(~fcs); 
}

///////////////dong ho thoi gian thuc TIM1//////////////////////
void Clock_TIM1(void)           
{
  count_s++;
  Second++;
  if(count_s>0xfff0)
  {
    count_s=0;
  }
  if(Second>=59)
  {
    Second=0;
    Minute++;
  }
  if(Minute>=59)
  {
    Minute=0;
    Hour++;
  }
  if(Hour>23)
  {
    Hour=Hour%24;
  }
  HAL_GPIO_TogglePin(LED_PORT,LED3_PIN);
  HAL_UART_Receive_IT(&huart1,Rx_data, 1);	//Kich hoat UART1 nhan du lieu ngat moi luc
  HAL_UART_Receive_IT(&huart3, Rx_NEO, 1);

}
////////////////////////ngat uart nhan du lieu////////////////////////////////////////////
void UART_Rx_Call(UART_HandleTypeDef *huart)
{
  if(Rx_data[0]==0x0d){ Rx_sta=0; ind=0;}
  switch (Rx_sta)
  {
      case 0:   //kiem tra cac truong hop
      {
        /////////Rx_plus_sta nhan nhung cau dai vo han////////////////////////////
        if(Rx_data[2]==0x0a&Rx_data[1]==0x78&Rx_data[0]==0x78) {server_78=1; Rx_plus_sta=1; ind_server=0;}   // server tra loi (1)
        if(Rx_data[2]=='C'&Rx_data[1]=='M'&Rx_data[0]=='T'){Rx_plus_sta=2; ind_sms=0; sms_den=1; } // nhan tin nhan sms (2) 

        /////////// nhan biet trang thai ///////////////////
        if(Rx_data[2]=='O'&Rx_data[1]=='K'&Rx_data[0]==0x0d) {OK=1;}    // OK
        if(Rx_data[2]==0x0a&Rx_data[1]=='E'&Rx_data[0]=='R') {RRO=1;}   // ERROR
        if(Rx_data[2]=='N'&Rx_data[1]=='E'&Rx_data[0]=='C') {CONNECT=1;}   // CONNECT OK 
        
        //////////// Rx_sta nhan nhung cau ngan ...0x0d///////////////////
        if(Rx_data[0]=='8'&Rx_data[1]==0x0a){Rx_sta=1; GSN[ind]=Rx_data[0]; ind++;} //imei      (1)
        if(Rx_data[2]=='G'&Rx_data[1]=='N'&Rx_data[0]=='S'){Rx_sta=2;} //+CGNSINF:|+UGNSINF:    (2) 
        if(Rx_data[2]=='L'&Rx_data[1]=='I'&Rx_data[0]=='P'){Rx_sta=3;} // cuoc goi den          (3)
        if(Rx_data[2]=='P'&Rx_data[1]=='B'&Rx_data[0]=='R'){Rx_sta=4;} // doc danh ba sim       (4)
        
          break;
      }
      case 1:   //nhap imei
      {
          if(ind<15) //GSN[16]
          {
            GSN[ind]=Rx_data[0];
            ind++;
          }          
          break;
      }
      case 2:   //nhap GPS
      {
          if(ind<99) //UGNSINF[100]
          {
            UGNSINF[ind]=Rx_data[0];
            ind++;
          }   
          break;
      }
      case 3:   //sdt goi den
      {
          if(ind<19) //LIP[20]
          {
            LIP[ind]=Rx_data[0];
            ind++;
          }
          else { goi_den=1; }
            
          break;
      }
      case 4:   //doc danh ba sim
      {
          if(ind_CPBR<99) //CPBR[100]
          {
            CPBR[ind_CPBR]=Rx_data[0];
            ind_CPBR++;
          }   
          break;
      }

  }
  switch (Rx_plus_sta)
  {
    case 1: // nhan du lieu tu server 7878...0d0a
    {
      if(ind_server<19) //Rx_server[20]
      {
        Rx_server[ind_server]=Rx_data[0];
        ind_server++;
        if(Rx_data[2]==0x0d&Rx_data[1]==0x0a&Rx_data[0]==0x0d) {full_78=1; Rx_plus_sta=0;} // nhan full data , ko nhan data
      }

      break;
    }
    case 2: //nhan sms
    {
      if(ind_sms<99) //SMS[100]
      {
        SMS[ind_sms]=Rx_data[0];
        ind_sms++;
      }   
    
      break;
    }
  }
  

  Rx_data[2]=Rx_data[1];
  Rx_data[1]=Rx_data[0];
  
  
}

//////////////uart3 NEO////////////////////
void UART3_Rx_Call(void)
{
  if(Rx_NEO[0]==0x0d){ Rx_NEO_sta=0; ind_NEO=0;}
  switch (Rx_NEO_sta)
  {
      case 0:   //kiem tra cac truong hop
      {
        if(Rx_NEO[2]=='R'&Rx_NEO[1]=='M'&Rx_NEO[0]=='C')  Rx_NEO_sta=1;
          break;
      }
      case 1:   
      {
        if(ind_NEO<99)
          {
            GNRMC[ind_NEO]=Rx_NEO[0];
            ind_NEO++;
          }       
                   
          break;
      }
      case 2:   
      {
            
          break;
      }

  }

  Rx_NEO[2]=Rx_NEO[1];
  Rx_NEO[1]=Rx_NEO[0];
}
///////////doc toa do GPS NEO////////////
void Read_NEO(void)
{
  uint8_t dem=0,vitri[20],course_temp[10];
  uint8_t Speed_temp[2][10];
  uint32_t temp_GPS[2];
  
  for(uint8_t ps=0;ps<100;ps++)
      {
        if(GNRMC[ps]==',')
        {
          dem++;  //dem dau ,
          vitri[dem]=ps+1;
        }
      }
  //doc gia tri van toc//
    for(uint8_t j=0;j<(vitri[8]-vitri[7]-1);j++)
      {
        Speed_temp[0][j]=GNRMC[vitri[7]+j];     // nhap gia tri van toc Speed[0]
        if(Speed_temp[0][j]==0x2e) vitri[19]=j;         // tim dau cham .
        Speed_temp[1][j]= Speed_temp[0][j]-48;                // dich sang kieu Decima dang so 
      }
    switch(vitri[19])              // tinh gia tri theo vi tri dau . -> Speed[2][0]
        {
        case 1: 
          Speed=Speed_temp[1][0];
          break;
        case 2: 
          Speed=Speed_temp[1][0]*10+Speed_temp[1][1];
          break;
        case 3: 
          Speed=Speed_temp[1][0]*100+Speed_temp[1][1]*10+Speed_temp[1][2];
          break;
        }
    if(Speed<2) Speed=0;
    Speed=2*Speed;
  
  // nhap gia tri thoi gian 
        Second=0+(GNRMC[vitri[1]+4]-48)*10+(GNRMC[vitri[1]+5]-48);
        Minute=(GNRMC[vitri[1]+2]-48)*10+(GNRMC[vitri[1]+3]-48);
        Hour  =7+(GNRMC[vitri[1]]-48)*10+(GNRMC[vitri[1]+1]-48); if(Hour>24) Hour=Hour%24;
        Day   =(GNRMC[vitri[9]]-48)*10+(GNRMC[vitri[9]+1]-48); 
        Month =(GNRMC[vitri[9]+2]-48)*10+(GNRMC[vitri[9]+3]-48);
        Year  =2000+(GNRMC[vitri[9]+4]-48)*10+(GNRMC[vitri[9]+5]-48);
        
        //GPS_Map
      if((vitri[4]-vitri[3])>1) // khi co toa do GPS
      {
        for(uint8_t j=0;j<((vitri[4]-vitri[3]-1));j++) GPS_Map[0][j]=GNRMC[vitri[3]+j];  //nhap gia tri vao GPS_Map[0]   N
        for(uint8_t j=0;j<(vitri[6]-vitri[5]-1);j++) GPS_Map[1][j]=GNRMC[vitri[5]+j];    //nhap gia tri vao GPS_Map[1]   E
      
        for(uint8_t j=0;j<10;j++) // dem theo so ki tu GPS_Map[0]
        {      
          GPS_Map[0][j]=GPS_Map[0][j]-48; // GPS_Map[0] dich sang kieu Decima dang so
          GPS_Map[1][j]=GPS_Map[1][j]-48; // GPS_Map[1] dich sang kieu Decima dang so
        }
        GPS_sta=1;      // trang thai co toa do
      }
      else
      {
        GPS_sta=0;      // trang thai ko toa do
      }
      if(Minute>59|Day>31|Month>12)
      {
        GPS_sta=0;
      }
      //tinh theo cong thuc GPS_Map[0] 
      temp_GPS[0]=(GPS_Map[0][0]*1000000+GPS_Map[0][1]*100000)*18+(GPS_Map[0][2]*10000+GPS_Map[0][3]*1000+GPS_Map[0][5]*100+GPS_Map[0][6]*10+GPS_Map[0][7])*30;      //22o32.7658=(22X60+32.7658)X30000=40582974          
      
