aptech-php-21-Huy/aptech-php-21-Huy/Du-an-ca-nhan/GNS_STM32F1 PCB_308_1/Src/stm32f1xx_GPS.c
      //tinh theo cong thuc GPS_Map[1] 
      temp_GPS[1]=(GPS_Map[1][0]*10000000+GPS_Map[1][1]*1000000+GPS_Map[1][2]*100000)*18+(GPS_Map[1][3]*10000+GPS_Map[1][4]*1000+GPS_Map[1][6]*100+GPS_Map[1][7]*10+GPS_Map[1][8])*30;      //22o32.7658=(22X60+32.7658)X30000=40582974
      
      //chuyen sang hex: GPS_Map[0] -> temp_GPS[0]-> GPS_Map[2]//
      GPS_Map[2][0]=temp_GPS[0]/(0xffffff+1);       
      GPS_Map[2][1]=(temp_GPS[0]%(0xffffff+1))/(0xffff+1);
      GPS_Map[2][2]=(temp_GPS[0]%(0xffff+1))/(0xff+1);
      GPS_Map[2][3]=temp_GPS[0]%(0xff+1);    
      
      //chuyen sang hex: GPS_Map[1] -> temp_GPS[1]-> GPS_Map[3]//
      GPS_Map[3][0]=temp_GPS[1]/(0xffffff+1);       
      GPS_Map[3][1]=(temp_GPS[1]%(0xffffff+1))/(0xffff+1);
      GPS_Map[3][2]=(temp_GPS[1]%(0xffff+1))/(0xff+1);
      GPS_Map[3][3]=temp_GPS[1]%(0xff+1);
      
      //doc gia tri course//
      vitri[19]=0;
      for(uint8_t j=0;j<10;j++)
      {
        course_temp[j]=GNRMC[vitri[8]+j];     // nhap gia tri course[]
        if(course_temp[j]==0x2e) vitri[19]=j;         // tim dau cham .
        course_temp[j]= course_temp[j]-48;         // dich sang kieu Decima dang so 
      }
      switch(vitri[19])              // tinh gia tri theo vi tri dau . -> Course
        {
        case 1: 
          Course=course_temp[0];
          break;
        case 2: 
          Course=course_temp[0]*10+course_temp[1];
          break;
        case 3: 
          Course=course_temp[0]*100+course_temp[1]*10+course_temp[2];
          break;
        }
      Num=0x0b;
      map_N=temp_GPS[0];
      map_E=temp_GPS[1];

}
///////////////////////////// doc toa do gps ////////////////////////////////////
void Read_GPS(void)
{  
  
  uint8_t dem=0,vitri[20];
  uint8_t Speed_temp[2][10],course_temp[10];
  uint32_t temp_GPS[2];
  
  
  for(uint8_t ps=0;ps<100;ps++)
      {
        if(UGNSINF[ps]==',')
        {
          dem++;  //dem dau ,
          if(dem==0) vitri[0]=ps+1;
          if(dem==1) vitri[1]=ps+1; 
          if(dem==2) vitri[2]=ps+1;
          if(dem==3) vitri[3]=ps+1;
          if(dem==4) vitri[4]=ps+1;
          if(dem==5) vitri[5]=ps+1;
          if(dem==6) vitri[6]=ps+1;
          if(dem==7) vitri[7]=ps+1;
          if(dem==8) vitri[8]=ps+1;
          if(dem==9) vitri[9]=ps+1;
          if(dem==10) vitri[10]=ps+1;
          if(dem==11) vitri[11]=ps+1;
          if(dem==12) vitri[12]=ps+1;
          if(dem==13) vitri[13]=ps+1;
          if(dem==14) vitri[14]=ps+1;
          if(dem==15) vitri[15]=ps+1;
          if(dem==16) vitri[16]=ps+1;
          if(dem==17) vitri[17]=ps+1; 
          if(dem==18) vitri[18]=ps+1;
        }
      }
  if(dem>14)
  {
    //doc gia tri van toc//
    for(uint8_t j=0;j<(vitri[7]-vitri[6]-1);j++)
      {
        Speed_temp[0][j]=UGNSINF[vitri[6]+j];     // nhap gia tri van toc Speed[0]
        if(Speed_temp[0][j]==0x2e) vitri[19]=j;         // tim dau cham .
        Speed_temp[1][j]= Speed_temp[0][j]-48;                // dich sang kieu Decima dang so 
      }
    switch(vitri[19])              // tinh gia tri theo vi tri dau . -> Speed[2][0]
        {
        case 1: 
          Speed=Speed_temp[1][0];
          break;
        case 2: 
          Speed=Speed_temp[1][0]*10+Speed_temp[1][1];
          break;
        case 3: 
          Speed=Speed_temp[1][0]*100+Speed_temp[1][1]*10+Speed_temp[1][2];
          break;
        }
    if(Speed<4) Speed=0;
    // nhap gia tri thoi gian 
        Second=0+(UGNSINF[vitri[2]+12]-48)*10+(UGNSINF[vitri[2]+13]-48);
        Minute=(UGNSINF[vitri[2]+10]-48)*10+(UGNSINF[vitri[2]+11]-48);
        Hour  =7+(UGNSINF[vitri[2]+8]-48)*10+(UGNSINF[vitri[2]+9]-48);
        Day   =(UGNSINF[vitri[2]+6]-48)*10+(UGNSINF[vitri[2]+7]-48); 
        Month =(UGNSINF[vitri[2]+4]-48)*10+(UGNSINF[vitri[2]+5]-48);
        Year  =(UGNSINF[vitri[2]]-48)*1000+(UGNSINF[vitri[2]+1]-48)*100+(UGNSINF[vitri[2]+2]-48)*10+(UGNSINF[vitri[2]+3]-48);
    //GPS_Map
      if((vitri[4]-vitri[3])>1) // khi co toa do GPS
      {
        for(uint8_t j=0;j<((vitri[4]-vitri[3]-1));j++) GPS_Map[0][j]=UGNSINF[vitri[3]+j];  //nhap gia tri vao GPS_Map[0]   N
        for(uint8_t j=0;j<(vitri[5]-vitri[4]-1);j++) GPS_Map[1][j]=UGNSINF[vitri[4]+j];    //nhap gia tri vao GPS_Map[1]   E
      
        for(uint8_t j=0;j<10;j++) // dem theo so ki tu GPS_Map[0]
        {      
          GPS_Map[0][j]=GPS_Map[0][j]-48; // GPS_Map[0] dich sang kieu Decima dang so
          GPS_Map[1][j]=GPS_Map[1][j]-48; // GPS_Map[1] dich sang kieu Decima dang so
        }
        GPS_sta=1;      // trang thai co toa do
      }
      else
      {
        GPS_sta=0;      // trang thai ko toa do
      }
      //tinh theo cong thuc GPS_Map[0] 
      temp_GPS[0]=(GPS_Map[0][0]*1000000+GPS_Map[0][1]*100000+GPS_Map[0][3]*10000+GPS_Map[0][4]*1000+GPS_Map[0][5]*100+GPS_Map[0][6]*10+GPS_Map[0][7])*18;      //22o32.7658=(22X60+32.7658)X30000=40582974          
      
      //tinh theo cong thuc GPS_Map[1] 
      temp_GPS[1]=(GPS_Map[1][0]*10000000+GPS_Map[1][1]*1000000+GPS_Map[1][2]*100000+GPS_Map[1][4]*10000+GPS_Map[1][5]*1000+GPS_Map[1][6]*100+GPS_Map[1][7]*10+GPS_Map[1][8])*18;      //22o32.7658=(22X60+32.7658)X30000=40582974
      
      //chuyen sang hex: GPS_Map[0] -> temp_GPS[0]-> GPS_Map[2]//
      GPS_Map[2][0]=temp_GPS[0]/(0xffffff+1);       
      GPS_Map[2][1]=(temp_GPS[0]%(0xffffff+1))/(0xffff+1);
      GPS_Map[2][2]=(temp_GPS[0]%(0xffff+1))/(0xff+1);
      GPS_Map[2][3]=temp_GPS[0]%(0xff+1);    
      
      //chuyen sang hex: GPS_Map[1] -> temp_GPS[1]-> GPS_Map[3]//
      GPS_Map[3][0]=temp_GPS[1]/(0xffffff+1);       
      GPS_Map[3][1]=(temp_GPS[1]%(0xffffff+1))/(0xffff+1);
      GPS_Map[3][2]=(temp_GPS[1]%(0xffff+1))/(0xff+1);
      GPS_Map[3][3]=temp_GPS[1]%(0xff+1);
      
      //doc gia tri course//
      vitri[19]=0;
      for(uint8_t j=0;j<10;j++)
      {
        course_temp[j]=UGNSINF[vitri[7]+j];     // nhap gia tri course[]
        if(course_temp[j]==0x2e) vitri[19]=j;         // tim dau cham .
        course_temp[j]= course_temp[j]-48;         // dich sang kieu Decima dang so 
      }
      switch(vitri[19])              // tinh gia tri theo vi tri dau . -> Course
        {
        case 1: 
          Course=course_temp[0];
          break;
        case 2: 
          Course=course_temp[0]*10+course_temp[1];
          break;
        case 3: 
          Course=course_temp[0]*100+course_temp[1]*10+course_temp[2];
          break;
        }
      
