aptech-php-21-Huy/aptech-php-21-Huy/Du-an-ca-nhan/GNS_STM32F1 PCB_308_1/Src/stm32f1xx_GPS.c
      //doc gia tri Num, tai vitri[5]//

      if((vitri[15]-vitri[14])==3)    // neu gia tri 2 chu so
      {
        Num=(UGNSINF[vitri[14]]-48)*10 + UGNSINF[vitri[14]+1]-48;         // chuyen char sang so va tinh gia tri -> dang 0F 
      }
      if((vitri[15]-vitri[14])==2)    // neu gia tri 1 chu so
      {
        Num=(UGNSINF[vitri[14]]-48);                                          // chuyen char sang so va tinh gia tri -> dang 0F 
      }
      
      //doc gia tri song DB//
      DB[0]=UGNSINF[vitri[18]];
      DB[1]=UGNSINF[vitri[18]+1];
      DB[2]=(DB[0]-0x30)*0x10+(DB[1]-0x30);
  }  
}
////////////khoi tao sim/////////////
void Khoi_Tao_Sim(void)
{

    printf("AT\r\n"); ////
    HAL_Delay(100);
    printf("ATE0\r\n");         // ATE0 ko hien thi gia tri gui xuong
    HAL_Delay(100);
    printf("AT+CLIP=1\r\n");
    HAL_Delay(100);    
    printf("AT+CMGF=1\r\n");    //bat che do truyen nhan sms
    HAL_Delay(100);
    //printf("AT+CGPSPWR=1\r\n"); // bat GPS
    //HAL_Delay(100);
    printf("AT+CGNSPWR=0\r\n"); // bat GNS
    HAL_Delay(100);
    printf("AT+CNMI=2,2\r\n");  // hien thi ngay noi dung khi co tin nhan den
    HAL_Delay(100);
    printf("AT&W\r\n");         //luu lai cac thiet lap
    HAL_Delay(500);
}
///////// tu cap nhat GNS theo chu ky /////////////
void AT_CGNSURC(uint8_t t)
{
  printf("AT + CGNSURC =%d \r\n", t );
  HAL_Delay(300); 
}
void Read_imei(void)
{
  printf("AT+GSN\r\n");
  HAL_Delay(2000);
  for(int j=1;j<16;j++) // nhap imei
  {
    imei[0][j]=GSN[j-1];  
  }
  imei[0][0]='0';          // them so 0 vao vi tri dau tien
  for(int j=0;j<8;j++)  // chuyen sang dang hex luu vao imei[1]
  {
    imei[1][j]=((imei[0][j*2])-48)*16+imei[0][j*2+1]-48;  
  }

}
////////cap nhat GNS tu module sim//////////
void AT_CGNSINF(void)
{
  printf("AT+CGNSINF\r\n");
  HAL_Delay(1000);
}
//////////ket noi serve////////////
void Connet_Server(void)
{
  //char IP[26]={34,'T','C','P',34,44,34,'1','1','2',46,'7','8',46,'1',46,'8','5',34,44,34,'5','0','2','3',34}; // chuoi dia chi ket noi server
  
  OK=0; 
  printf("AT+CIPSHUT\r\n");
  for(uint8_t j=0;j<30;j++)     // cho SHUT OK, toi da 3000ms
  {
    HAL_Delay(100);     
    if(OK==1)
    {
      j=30;     // thoat khi SHUT OK    
    }
  }
  CONNECT=0;
  //AT+CIPSTART="TCP","112.78.3.172","5023"//
  printf("AT+CIPSTART=\"TCP\"\,\"112.78.3.172\"\,\"5023\"\r\n");

  for(uint8_t j=0;j<70;j++)     // cho CONNECT OK, toi da 7000ms
  {
    HAL_Delay(100);     
    if(CONNECT==1)
    {
      j=70;     // CONNECT OK    
    }
  }
}
///////////////bien dich du lieu chan bi gui server////////////////////
void TinhDataSever(uint8_t mode_tinh)
{
  //uint8_t send_0[4]={0x78,0x78,0x0d,01},  send_end[3]={0x0d,0x0a,0x1a}; //0x1a la ctrl+z ket thuc 
  uint8_t send_start[2]={0x78,0x78}, send_stop[2]={0x0d,0x0a},dem_lan_gui;
  uint16_t temp;
  switch (mode_tinh) 
  {
    case 1:             //mode tinh imei
        lan_gui++;
        temp_data[0]=0x0d;        // so luong byte gui ( Packet Length ) 
        temp_data[1]=0x01;        //kieu du lieu ( Protocol Number )
        for(uint8_t j=2;j<10;j++)  // nhap imei[1] dang hex
        {
          temp_data[j]=imei[1][j-2];
        }
        temp_data[10]=lan_gui/256;            // nhap byte thu 1 bien lan_gui 
        temp_data[11]=lan_gui%256;           // nhap byte thu 2 bien lan_gui
        temp=GetCrc16(temp_data,12);          // tinh CRC
        temp_data[12]=temp/256;               // nhap byte CRC thu 1
        temp_data[13]=temp%256;               // nhap byte CRC thu 2
        
       for(int j=0;j<2;j++) data_server[j]=send_start[j];         // nhap tu vi tri 0 toi 1: 7878
       for(int j=2;j<16;j++) data_server[j]=temp_data[j-2];       // nhap tu vi tri 2  toi 15: temp_data
       for(int j=16;j<18;j++) data_server[j]=send_stop[j-16];     // nhap tu vi tri 16  toi 17: 0d0a
        
        
      break;
    case 2 :            // tinh toa do, thoi gian, van toc...
     lan_gui++;
     temp_data[0]=0x1f;        // so luong byte gui ( Packet Length ) 
     temp_data[1]=0x12;        //kieu du lieu ( Protocol Number )
      // data time //
     temp_data[2]= Year%100;
     temp_data[3]= Month;
     temp_data[4]= Day;
     temp_data[5]= Hour;
     temp_data[6]= Minute;
     temp_data[7]= Second;     
     temp_data[8]=0xC0+Num;     // Length of GPS information, quantity of positioning satellites
     // tinh toa do //
     for(uint8_t j=9;j<13;j++){ temp_data[j]=GPS_Map[2][j-9]; }      // nhap kinh do
     for(uint8_t j=13;j<17;j++){ temp_data[j]=GPS_Map[3][j-13]; }      // nhap vi do
     // tinh van toc//
     temp_data[17]=Speed;
     temp_data[18]=0x14+(Course/(0xff+1)); temp_data[19]=Course%(0xff+1);  //Status,Course       
     temp_data[20]=0x01; temp_data[21]=0xc4;                    // ma quoc gia MCC 01c4
     temp_data[22]=0x04;                                        // ma nha mang MNC 04
     temp_data[23]=0x01; temp_data[24]=0xc4;                    // ma LAC
     temp_data[25]=0x01; temp_data[26]=0xc4; temp_data[27]=0xc4; // Cell ID
     temp_data[28]=lan_gui/256;            // nhap byte thu 1 bien lan_gui 
     temp_data[29]=lan_gui%256;           // nhap byte thu 2 bien lan_gui
     temp=GetCrc16(temp_data,30);          // tinh CRC
     temp_data[30]=temp/256;               // nhap byte CRC thu 1
     temp_data[31]=temp%256;               // nhap byte CRC thu 2
     
     for(uint8_t j=0;j<2;j++) data_server[j]=send_start[j];         // nhap tu vi tri 0 toi 1: 7878
     for(uint8_t j=2;j<34;j++) data_server[j]=temp_data[j-2];       // nhap tu vi tri 2  toi 33: temp_data
     for(uint8_t j=34;j<36;j++) data_server[j]=send_stop[j-34];     // nhap tu vi tri 34  toi 35: 0d0a      
       
      break;
      
    case 3:               //Alarm packet trang thai
    lan_gui++;
    
    temp_data[0]=0x25;        // so luong byte gui ( Packet Length ) 
    temp_data[1]=0x16;        //kieu du lieu ( Protocol Number )
      // data time //
     temp_data[2]= Year%100;
     temp_data[3]= Month;
     temp_data[4]= Day;
     temp_data[5]= Hour;
     temp_data[6]= Minute;
     temp_data[7]= Second;
     temp_data[8]=0xC0+Num;     // Length of GPS information, quantity of positioning satellites
     // tinh toa do //
     for(uint8_t j=9;j<13;j++){ temp_data[j]=GPS_Map[2][j-9]; }      // nhap kinh do
     for(uint8_t j=13;j<17;j++){ temp_data[j]=GPS_Map[3][j-13]; }      // nhap vi do
     // tinh van toc//
     temp_data[17]=Speed;
     temp_data[18]=0x14+(Course/(0xff+1)); temp_data[19]=Course%(0xff+1);  //Status,Course     
     //LBS Information//
     temp_data[20]=0x09;        //LBS Length
     temp_data[21]=0x01; temp_data[22]=0xc4;                    // ma quoc gia MCC 01c4
     temp_data[23]=0x04;                                        // ma nha mang MNC 04
     temp_data[24]=0x01; temp_data[25]=0xc4;                    // ma LAC
     temp_data[26]=0x01; temp_data[27]=0xc4; temp_data[28]=0xc4; // Cell ID
     //Terminal Information//
     temp_data[29]=0xc7;  //Terminal Information Content
     temp_data[30]=0x04;       // Voltage Level 0~6
     temp_data[31]=0x03;       //GSM Signal Strength Levels 0~4
     temp_data[32]=0x00;        //Alarm 0~5
     temp_data[33]=0x02;        //Language is English
     
     temp_data[34]=lan_gui/256;            // nhap byte thu 1 bien lan_gui 
     temp_data[35]=lan_gui%256;           // nhap byte thu 2 bien lan_gui
     temp=GetCrc16(temp_data,36);          // tinh CRC
     temp_data[36]=temp/256;               // nhap byte CRC thu 1
     temp_data[37]=temp%256;               // nhap byte CRC thu 2
     
     for(uint8_t j=0;j<2;j++) data_server[j]=send_start[j];         // nhap tu vi tri 0 toi 1: 7878
     for(uint8_t j=2;j<40;j++) data_server[j]=temp_data[j-2];       // nhap tu vi tri 2  toi 39: temp_data
     for(uint8_t j=40;j<42;j++) data_server[j]=send_stop[j-40];     // nhap tu vi tri 40  toi 41: 0d0a
          
    break;
  case 4:             // Terminal Sending Heartbeat Packet to Server
    
