aptech-php-21-Huy/aptech-php-21-Huy/Du-an-ca-nhan/GNS_STM32F1 PCB_308_1/Src/stm32f1xx_GPS.c
    lan_gui++;

     temp_data[0]=0x0a;        // so luong byte gui ( Packet Length ) 
     temp_data[1]=0x01;        //kieu du lieu ( Protocol Number )
      //Terminal Information//
     temp_data[2]=0xc7;  //Terminal Information Content
     temp_data[3]=0x04;       // Voltage Level 0~6
     temp_data[4]=0x03;       //GSM Signal Strength Levels 0~4
     temp_data[5]=0x00;        //Alarm 0~5
     temp_data[6]=0x02;        //Language is English
     
     temp_data[7]=lan_gui/256;            // nhap byte thu 1 bien lan_gui 
     temp_data[8]=lan_gui%256;           // nhap byte thu 2 bien lan_gui
     temp=GetCrc16(temp_data,9);          // tinh CRC
     temp_data[9]=temp/256;               // nhap byte CRC thu 1
     temp_data[10]=temp%256;               // nhap byte CRC thu 2
     
     for(uint8_t j=0;j<2;j++) data_server[j]=send_start[j];         // nhap tu vi tri 0 toi 1: 7878
     for(uint8_t j=2;j<13;j++) data_server[j]=temp_data[j-2];       // nhap tu vi tri 2  toi 12: temp_data
     for(uint8_t j=13;j<15;j++) data_server[j]=send_stop[j-13];     // nhap tu vi tri 13  toi 14: 0d0a 
    break;
    
  case 5:       //tinh trang khi toa do GPS 00, phan ++ serve ko yeu cau
    lan_gui++;

     temp_data[0]=0x0c;        // so luong byte gui ( Packet Length ) 
     temp_data[1]=0x05;        //kieu du lieu ( Protocol Number )
      // data time //
     temp_data[2]= Year%100;
     temp_data[3]= Month;
     temp_data[4]= Day;
     temp_data[5]= Hour;
     temp_data[6]= Minute;
     temp_data[7]= Second;
     temp_data[8]=0xC0+Num;     // Length of GPS information, quantity of positioning satellites
     temp_data[9]=lan_gui/256;            // nhap byte thu 1 bien lan_gui 
     temp_data[10]=lan_gui%256;           // nhap byte thu 2 bien lan_gui
     temp=GetCrc16(temp_data,11);          // tinh CRC
     temp_data[11]=temp/256;               // nhap byte CRC thu 1
     temp_data[12]=temp%256;               // nhap byte CRC thu 2
     
     for(uint8_t j=0;j<2;j++) data_server[j]=send_start[j];         // nhap tu vi tri 0 toi 1: 7878
     for(uint8_t j=2;j<14;j++) data_server[j]=temp_data[j-2];       // nhap tu vi tri 2  toi 13: temp_data
     for(uint8_t j=14;j<16;j++) data_server[j]=send_stop[j-14];     // nhap tu vi tri 14  toi 15: 0d0a
    break;
  case 6:       //gui tinh trang...   serve ko yeu cau
    lan_gui++;
    temp_data[0]=0x17;        // so luong byte gui ( Packet Length ) 
    temp_data[1]=0x05;        //kieu du lieu ( Protocol Number )
    
    for(uint8_t j=2;j<10;j++)  // nhap imei[1] dang hex
        {
          temp_data[j]=imei[1][j-2];
        }
    // data time //
     temp_data[10]= Year%100;
     temp_data[11]= Month;
     temp_data[12]= Day;
     temp_data[13]= Hour;
     temp_data[14]= Minute;
     temp_data[15]= Second;
     temp_data[16]=0xC0+Num;     // Length of GPS information, quantity of positioning satellites
     temp_data[17]= 0xff;
     temp_data[18]= DB[2]; //cuong do song GPS
     temp_data[19]= 0xDD;
     temp_data[20]=lan_gui/256;            // nhap byte thu 1 bien lan_gui 
     temp_data[21]=lan_gui%256;           // nhap byte thu 2 bien lan_gui
     temp=GetCrc16(temp_data,22);          // tinh CRC
     temp_data[22]=temp/256;               // nhap byte CRC thu 1
     temp_data[23]=temp%256;               // nhap byte CRC thu 2
     
     for(uint8_t j=0;j<2;j++) data_server[j]=send_start[j];         // nhap tu vi tri 0 toi 1: 7878
     for(uint8_t j=2;j<26;j++) data_server[j]=temp_data[j-2];       // nhap tu vi tri 2  toi 25: temp_data
     for(uint8_t j=26;j<28;j++) data_server[j]=send_stop[j-26];     // nhap tu vi tri 26  toi 27: 0d0a
     
     break;
  }
}
////////////////////////// TRUYEN DU LIEU SERVER/////////////////////////
void Send_Server(void)
{
  uint8_t length=data_server[2]+5;
  printf("AT+CIPSEND=%d\r\n",length);
  HAL_Delay(500);
  HAL_UART_Transmit(&huart1,data_server,length, 1000);
  HAL_Delay(1500); 
  
}
//////////gui tin nhan sms////////////
void send_sms(const char *sdt, const char *noi_dung)
{
  uint8_t ket_thuc[3]={0x1a,0x0d,0x0a};
  if(JAS_IndexOf(sdt,"+84")==0)
  {
    printf("AT+CMGS=\"%s\"\r\n",sdt);
    HAL_Delay(1000);
    printf("%s",noi_dung);
    HAL_UART_Transmit(&huart1,ket_thuc,1, 1000);
    HAL_Delay(1000);
  }
  
}
/////////luu so dien thoai vao danh ba/////////
void save_Phonebook()
{
  for(int k=0;k<2;k++)
  {
    printf("AT+CPBW=%d\,\"%s\" \,129\, \r\n" ,(k+1),user[k]);   // AT+CPBW=vitri,
    HAL_Delay(500);         
  }

}
/////luu sdt admin//// 
void save_admin()
{
  printf("AT+CPBW=%d\,\"%s\" \,129\, \r\n" ,3,user[2]);   // AT+CPBW=vitri,
  HAL_Delay(500);

}

///////////doc sdt trong danh ba sim//////////////
void read_Phonebook(void)
{
  uint8_t vitri_start,vitri_end;
  uint8_t l; //do dai chuoi
  ind_CPBR=0;
  for(uint8_t n=0;n<100; n++) // xoa du lieu truoc khi ghi
  {
    CPBR[n]=0;
  }
  ind_CPBR=0;
  
  printf("AT+CPBR=1,3\r\n");
  HAL_Delay(3000);
  for(uint8_t n=0;n<12; n++) // xoa du lieu truoc khi ghi
      {
        user[0][n]=0;
        user[1][n]=0;
        user[2][n]=0;
      }
  for(uint8_t m=0;m<3;m++) // lay 3 sdt trong danh ba
  {
    vitri_start=JAS_IndexOf(CPBR,"\,\"")+2;     // ,"
    vitri_end=JAS_IndexOf(CPBR,"\"\,129");     // ",129
    l=vitri_end-vitri_start;
    for(uint8_t n=0;n<l ; n++)
    {
      user[m][n]=CPBR[n+vitri_start];    
    }
    vitri_end=JAS_IndexOf(CPBR,"\"\:")+2; //tim vi tri het cau xuong dong
    for(uint8_t n=0;n<vitri_end ; n++)    // xoa cau da lay du lieu
    {
      if(CPBR[n]<'0'|CPBR[n]>'9') CPBR[n]=' '; //chi de lai so 0-9  
    }
  }  
  
  sdt_84(); // lay sdt gui sms  
}
///////doc sms, tach noi dung lay sdt///////////
void read_sms(void)
{
  
  uint8_t vitri_start,vitri_end;
  uint8_t l; //do dai chuoi
  ////// lay sdt vua gui//////////
  for(uint8_t n=0;n<15; n++) // xoa du lieu truoc khi ghi
      {
        sdt_ing[n]=0;
      }
    vitri_start=JAS_IndexOf(SMS,"\"+")+1; // "+
    vitri_end=JAS_IndexOf(SMS,"\"\,");    // ",
    l=vitri_end-vitri_start;
    for(uint8_t n=0;n<l ; n++) // lay sdt dang nhan tin sms
      {
        sdt_ing[n]=SMS[n+vitri_start];    
      }
  /////////////////////////// 
  if(JAS_IndexOf(SMS,"SDT")>=0) // tim SDT  > -1
  {
    sms_sta=1; //chon luu danh ba bang tin nhan
    
    for(uint8_t n=0;n<12; n++) // xoa du lieu truoc khi ghi
      {
        user[0][n]=0;
        user[1][n]=0;
        
