aptech-php-21-Huy/aptech-php-21-Huy/Du-an-ca-nhan/GNS_STM32F1 PCB_308_1/Src/stm32f1xx_GPS.c
      }    
    for(uint8_t m=0;m<2;m++) // lay 2 sdt trong SMS
    {
      vitri_start=JAS_IndexOf(SMS,"\*")+1; // *
      vitri_end=JAS_IndexOf(SMS,"\#");    // #
      l=vitri_end-vitri_start;
      for(uint8_t n=0;n<l ; n++)
      {
        user[m][n]=SMS[n+vitri_start];    
      }
      vitri_end=vitri_end+1;
      for(uint8_t n=0;n<vitri_end ; n++)    // xoa cau da lay du lieu
      {
        if(SMS[n]<'0'|SMS[n]>'9') SMS[n]=' '; //chi de lai so 0-9  
      }    
    }
  }
  ////////////////////
  if(JAS_IndexOf(SMS,"RELAY")>=0)
  {
    sms_sta=2; //chon dieu kien relay bang tin nhan  
  }
  ////////////////
  if(JAS_IndexOf(SMS,"ADMIN")>=0)
  {
    sms_sta=3; //chon luu sdt admin 
    for(uint8_t n=0;n<12; n++) // xoa du lieu truoc khi ghi
      {
        user[2][n]=0;        
      }    
    ///tach sdt trong tin nhan///
    vitri_start=JAS_IndexOf(SMS,"\*")+1; // *
    vitri_end=JAS_IndexOf(SMS,"\#");    // #
    l=vitri_end-vitri_start;
    for(uint8_t n=0;n<l ; n++)
    {
      user[2][n]=SMS[n+vitri_start];    
    }
    
  }
  ///////////////
  if(JAS_IndexOf(SMS,"INFO")>=0)
  {
    sms_sta=4; //chon thong bao trang thai bang tin nhan
  }
  
  
}
///////tach sdt cuoc goi den /////////////
void cuoc_goi_den(void)
{
  uint8_t vitri_start,vitri_end;
  uint8_t l; //do dai chuoi
  for(uint8_t n=0;n<15; n++) // xoa du lieu truoc khi ghi
    {
      sdt_ing[n]=0;
    }
  vitri_start=JAS_IndexOf(LIP," \"")+2; // "+
  vitri_end=JAS_IndexOf(LIP,"\"\,");    // ",
  l=vitri_end-vitri_start;
  for(uint8_t n=0;n<l ; n++) // lay sdt dang nhan tin sms
    {
      sdt_ing[n]=LIP[n+vitri_start];    
    }   
}
void ATD (const char *goi_sdt)
{
  if(JAS_IndexOf(goi_sdt,"00")!=0)
  {
    printf("AT\r\n");
    HAL_Delay(500);
    HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
    printf("ATD %s\;\r\n",goi_sdt);
    HAL_Delay(15000);
    HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
    HAL_Delay(15000);
    printf("ATH\r\n");    
  }
 
}
///////// them +84... de gui sms///////
void sdt_84(void)
{
  
  for(uint8_t n=0;n<3;n++)
  {
    //if(JAS_IndexOf(user[n],"00")!=0 ) // khac 00...
    if(user[n][0]=='0'& user[n][1]!='0') //0x...
    {
      sprintf(user_sms[n],"+84");
      for(uint8_t m=0;m<12;m++)
      {
          user_sms[n][m+3]=user[n][m+1];
      }    
    }      
  }

}
/////////tim chuoi trong chuoi/////
int JAS_IndexOf(const char *text, const char *key)
{
	int index = -1;
	char *found = strstr( text, key);
	if (found != NULL) index = found - text;
	return index;
}
////////kiem tra dieu kien ben ngoai////////////////
void GPIO_EXTI()
{
  uint8_t temp_Acquy; 

  temp_Acquy=!HAL_GPIO_ReadPin(IN_PORT,IN4_PIN);  
  DongCo=!HAL_GPIO_ReadPin(IN_PORT,IN2_PIN);
  if(DongCo==1) status=1; // dang mo may
    else        status=2; // dang tat may
  if(temp_Acquy==0&Acquy==1) SOS=1; // acquy vua ngat, bat khan cap SOS 3 lan

  Acquy=temp_Acquy; // luu lai gia tri acquy

}
/////////***************///////////////////
void GPS_server(void) ///gui toa do GPS len server
{
  uint8_t ket_thuc[3]={0x1a,0x0d,0x0a};
  if(server_78==0) dem_0078++; //dem so lan server ko tra loi
  else dem_0078=0;
  if(dem_0078>=6) //server ko tr loi lien tiep 6 lan
  {
    //HAL_UART_Transmit(&huart1,ket_thuc,1, 1000); 
    //HAL_Delay(500);
    HAL_IWDG_Start(&hiwdg);
    PWR_KEY();
    Khoi_Tao_Sim();
    Read_imei();
    TinhDataSever(1);
    Send_Server();    
  }
  /////////////////////
  Read_NEO();
  RRO=0; server_78=0;OK=0;
  if(GPS_sta==1)
  {
    TinhDataSever(2);
        
  }
  else
  {
     TinhDataSever(1);
     
  }
  Send_Server();
  for(uint8_t n=0;n<3;n++) //toi da 3 lan sua loi
  {
    HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
    if(RRO==1)    //gui bi loi
    {
      RRO=0; OK=0;
      Connet_Server();    //ket noi lai
      TinhDataSever(1);
      Send_Server();
      //Read_NEO();       // gui them toa do
      //TinhDataSever(2);
      //Send_Server();
      
      if(n>=2)
      {
        HAL_IWDG_Start(&hiwdg);
        PWR_KEY();
        Khoi_Tao_Sim();      
      }
    }
    else
    {
      n=3; //thoat    
    }
  }
  

}
//xu ly cuoc goi
void cuoc_goi(void)
{

  if(goi_den==1)      // xu ly cuoc goi den
  {
    printf("ATH\r\n"); //ket thu cuoc goi
    HAL_Delay(500);
    cuoc_goi_den();
    HAL_Delay(3000); // cho on dinh trc khi doc danh ba
    read_Phonebook(); // doc danh ba
    if(JAS_IndexOf(CPBR,sdt_ing)>0)  // tim sdt vua goi trong danh ba
    {
      RELAY(0); //tat may
      HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
      ATD(sdt_ing);     
    }   
    
    goi_den=0;
  }
}
// xu ly tin nhan sms
void tin_nhan(void)
{
  char noi_dung_sms[100];
  
  if(sms_den==1)      // xu ly tin nhan sms den
    {
      HAL_Delay(3000);  // cho nhan full sms      
      read_sms();
      HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
      switch (sms_sta)
      {
        case 1:   // luu so dien thoai vao danh ba
        {
          save_Phonebook();
          HAL_Delay(2000); // cho on dinh trc khi doc danh ba
          read_Phonebook();
          sprintf(noi_dung_sms,"%s \r\n%s \r\n%s \r\n OK",user[0],user[1],user[2]);
          
          send_sms(sdt_ing,noi_dung_sms); // gui tin nhan phan hoi
          break;
        }
      case 2: // dieu kien relay
        {
          if(JAS_IndexOf(SMS,"ON")>=0) // lenh ON
          {
            RELAY(1);          
          }
          if(JAS_IndexOf(SMS,"OFF")>=0) // lenh OFF
          {
            RELAY(0);
          }
          HAL_Delay(500);
          GPIO_EXTI();  // kiem tra lai trang thai
          
            sprintf(noi_dung_sms,"OK");

          send_sms(sdt_ing,noi_dung_sms); // gui tin nhan phan hoi
          break;
        } 
      case 3: // luu sdt admin
        {
          save_admin();
          HAL_Delay(2000); // cho on dinh trc khi doc danh ba
          read_Phonebook();
          sprintf(noi_dung_sms,"%s \r\n%s \r\n%s \r\n OK",user[0],user[1],user[2]);
          
          send_sms(sdt_ing,noi_dung_sms); // gui tin nhan phan hoi
          break;
        }
     case 4: // INFO
        {
          HAL_Delay(3000); // cho on dinh trc khi doc danh ba
          read_Phonebook();
          sprintf(noi_dung_sms,
                  "GNRMC: %s\r\n CPBR:%s\r\n LIP:%s\r\n DONG CO:%d\r\n ACQUY:%d\r\n https://maps.google.com/maps?q=%.5f,%.5f",GNRMC,CPBR,LIP,DongCo,Acquy,(double) map_N/1800000,(double) map_E/1800000);
          
          send_sms(sdt_ing,noi_dung_sms); // gui tin nhan phan hoi
          break;
        }
      }        
      
      HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
      sms_den=0;
    
    }
}
// xu ly khan cap SOS
void khan_cap(void)
{
  uint8_t tg_nd[20]; //thoi gian _ noi dung
  if(SOS==1)      // xu ly truong hop khan cap
    {
      sprintf(tg_nd,"SOS\r\n %d:%d\r\nACQUY OFF",Hour,Minute);
      HAL_Delay(3000); // cho on dinh
      read_Phonebook();
      for(uint8_t n=0;n<3;n++)
      {        
        send_sms(user_sms[n],tg_nd); 
        HAL_Delay(5000);
        HAL_IWDG_Refresh(&hiwdg); // IWDG_Refresh
        ATD(user[n]);
      }
      SOS=0;    
    }

}
//dieu khien relay on off
void RELAY (uint8_t on)
{
  if(on==1)
  {
    HAL_GPIO_WritePin(OUT_PORT,OUT4_PIN,GPIO_PIN_RESET);  // on
  }
  else
  {
    Read_NEO(); // cap nhat lay van toc
    if(Speed==0) HAL_GPIO_WritePin(OUT_PORT,OUT4_PIN,GPIO_PIN_SET); //off neu dang dung V=0      
  
  } 

}
//kich hoat module sim
void PWR_KEY(void)
{
star:
    HAL_GPIO_WritePin(PWR_KEY_PORT,PWR_KEY_PIN,GPIO_PIN_RESET);
    HAL_Delay(1000);
    HAL_GPIO_WritePin(PWR_KEY_PORT,PWR_KEY_PIN,GPIO_PIN_SET);
    HAL_Delay(3000);
    OK=0;
    printf("AT\r\n");
    HAL_Delay(500);
    if(OK==0) goto star;
    HAL_Delay(3000);  
}
//chuyen tiep uart2
void chuyen_tiep_78(void)
{
  if(server_78==1 & full_78==1)
  {    
    HAL_UART_Transmit(&huart3,Rx_server,ind_server,1000);
    full_78=0;
  }
}


/**
* @brief This function handles Hard fault interrupt.
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
